# Задайте словарь из n чисел последовательности (1 + (1/n))^n и выведите на экран их сумму.
# *Пример:*
# - Для n = 3:  {1: 2, 2: 2.25 , 3: 2.37}

n = int(input('Введите число n: '))
dict = {}
sum = 0
for i in range(1, n + 1):
    dict[i] = round((1+(1/i))**i, 2)
    sum = dict[i] + sum
print(f'Для n = {n}: {dict}')
print(f'Сумма всех значений: {sum}')
